src/ex_Tabakon/DataProcessors/РМКУправляемыйРежим.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РМКУправляемыйРежим</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТБК_IDКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодУценки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>флПроставленаСкидкаПоАкции</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АкцизныеМарки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАкцизнойМарки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КодАкцизнойМарки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ТБКРегистрацияКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТБКРегистрацияКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Зарегестрирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/DataProcessors/РМКУправляемыйРежим/Forms/ТБКФорма_ЗарегистрироватьКлиентаВПрограммеЛояльности/Ext/Form/Module.bsl
&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	//Проверка заполения
	Если не ЗначениеЗаполнено(ТелефонКлиента) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните номер телефона";
		Сообщение.Поле = "ТелефонКлиента";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли не ЗначениеЗаполнено(ИмяКлиента) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните имя клиента";
		Сообщение.Поле = "ИмяКлиента";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли не ЗначениеЗаполнено(ДатаРождения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните дату рождения";
		Сообщение.Поле = "ДатаРождения";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	
	Возраст	=	ВычислитьВозраст(ДатаРождения);
	
	Если Возраст <18 тогда
		Сообщить("Нельзя регистрировать клиентов меньше 18 лет!");
		Возврат;	
	КонецЕсли;  
	
	Если Найти(ТелефонКлиента, " ") или Лев(ТелефонКлиента,3) <> "+79" или СтрДлина(ТелефонКлиента) <> 12  тогда
		Сообщить("Неверно указан номер!");
		Возврат;		
	КонецЕсли;
	
	ЗапрещенныеСимволы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ!№;%:?*()@#$^&*";
	
	Для Ном = 1 по СтрДлина(ЗапрещенныеСимволы) цикл
		Если Найти(ИмяКлиента,Сред(ЗапрещенныеСимволы,Ном,1))  тогда
			Сообщить("В имени клиента присутствуют запрещенные символы!");
			Возврат;	
		КонецЕсли;
	КонецЦикла;
	
	Если Найти(ИмяКлиента,Символ(34))  тогда //кавычка
		Сообщить("В имени клиента присутствуют запрещенные символы!");
		Возврат;
	КонецЕсли; 
	
	ЗарегистрироватьНаСервере();
	Закрыть();
КонецПроцедуры



&НаКлиенте
Процедура ТелефонКлиентаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если текст = "" тогда
		ЭтаФорма.ТекущийЭлемент.УстановитьГраницыВыделения(3,3);
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНаСервере()
	
	Магазин = ОбщегоНазначения.ПолучитьМагазин();
	рег = РегистрыСведений.ТБКРегистрацияКлиентов.СоздатьМенеджерЗаписи();
	Попытка
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение("app.samosale.ru",443,,,,,ssl);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Authorization", "Bearer " + Магазин.Расш_SamosaleApiКлюч);
		Заголовки.Вставить("Content-Type", "application/json");
		
		Запрос = Новый HTTPЗапрос("api/cash-box/create-client", Заголовки);
		
		СтруктураДляJSON = Новый Структура;
		СтруктураДляJSON.Вставить("phone", 		СокрЛП(ТелефонКлиента));
		
		//ДопСтуктураДляJSON = Новый Структура;
		//clientСтруктураJSON = Новый Структура;
		//clientСтруктураJSON.Вставить("fio", ИмяКлиента);
		//ДопСтуктураДляJSON.Вставить("client", clientСтруктураJSON);
		//ДопСтуктураДляJSON.Вставить("birthday", ДатаРождения);
		//СтруктураДляJSON.Вставить("extFields", ДопСтуктураДляJSON);
		
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();                       
		ЗаписатьJSON(Запись,СтруктураДляJSON);
		ТелоЗапроса = Запись.Закрыть();
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Результат = Соединение.ОтправитьДляОбработки(Запрос);
		
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
		СтруктураПречек = ОбщегоНазначенияВызовСервера.ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
		Чтение.Закрыть();
		
		Если СтрНайти(СтруктураПречек.message,"Телефон» уже занято") Тогда
			Сообщить("Телефон уже зарегистрирован");
			Возврат;
		КонецЕсли; 
		
		Если Результат.КодСостояния = 200 Тогда
			Рег.Телефон			=	СокрЛП(ТелефонКлиента);
			Рег.Имя				=	ИмяКлиента;
			Рег.ДатаРождения	=	ДатаРождения;
			Рег.Зарегестрирован = 	Истина;
			рег.Записать();
			Сообщить("Клиент успешно зарегистрирован в системе Samosale.");
			
		иначе
			Рег.Телефон			=	СокрЛП(ТелефонКлиента);
			Рег.Имя				=	ИмяКлиента;
			Рег.ДатаРождения	=	ДатаРождения;
			рег.Записать();
			//Сообщить("Проблемы с интернетом. Клиент будет зарегистрирован в Samosale позже.");
		КонецЕсли;
		
	Исключение		
		
		Рег.Телефон			=	СокрЛП(ТелефонКлиента);
		Рег.Имя				=	ИмяКлиента;
		Рег.ДатаРождения	=	ДатаРождения;
		рег.Записать();
		Сообщить("Проблемы с интернетом. Клиент будет зарегистрирован в Samosale позже.");
	КонецПопытки;
	
КонецПроцедуры

&НаСерверебезКонтекста
Функция ВычислитьВозраст(ДатаРождения)

	Возраст = Год(Текущаядата()) - Год(ДатаРождения);	
	
	ДеньТекущий = День(Текущаядата());
	МесяцТекущий = Месяц(ТекущаяДата());
	
	ДеньРождения = День(ДатаРождения);
	МесяцРождения = Месяц(ДатаРождения);
	
	Если МесяцРождения > МесяцТекущий ИЛИ (МесяцРождения = МесяцТекущий И ДеньРождения > ДеньТекущий) Тогда
		
		Возраст = Возраст - 1;

	КонецЕсли;
	
	Возврат Возраст;	

КонецФункции 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТелефонКлиента = "+7" + Формат(ВладелецФормы.Samosale_НомерТелефона, "ЧГ=0");
КонецПроцедуры
